#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
policy" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-wallet-pdnd-api"
      + id                  = (known after apply)
      + operation_id        = "healthCheck"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <rewrite-uri template="/health" />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                    <choose>
                        <when condition="@(context.Response.StatusCode == 200)">
                            <set-body>@{
                                return $"{{ \"type\": \"about:blank\", \"title\": \"OK\", \"status\": 200, \"detail\": \"The service is healthy\", \"instance\": \"/status\" }}";
                            }</set-body>
                        </when>
                    </choose>
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.apim_itn.azurerm_api_management_api_operation_policy.set_wallet_instance_status_pdnd_policy will be created
  + resource "azurerm_api_management_api_operation_policy" "set_wallet_instance_status_pdnd_policy" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-wallet-pdnd-api"
      + id                  = (known after apply)
      + operation_id        = "setWalletInstanceStatus"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <!-- forwards the call to the Function App -->
                    <set-header name="x-functions-key" exists-action="override">
                        <value>{{io-wallet-user-func-key}}</value>
                    </set-header>
                </inbound>
                <outbound>
                    <base />
                </outbound>
                <backend>
                    <base />
                </backend>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.apim_itn.azurerm_api_management_api_operation_policy.set_wallet_instance_status_policy will be created
  + resource "azurerm_api_management_api_operation_policy" "set_wallet_instance_status_policy" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-ioweb-wallet"
      + id                  = (known after apply)
      + operation_id        = "setWalletInstanceStatus"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <!-- forwards the call to the Function App -->
                    <set-header name="Authorization" exists-action="delete" />
                    <set-method>PUT</set-method>
                    <set-header name="Content-Type" exists-action="override">
                        <value>application/json</value>
                    </set-header>
                    <set-variable name="requestBody" value="@{ return context.Request.Body.As<string>(preserveContent: true); }" />
                    <set-body>@{
                        var fiscalCode = context.Variables["fiscalCode"];
                        var status = context.Variables["requestBody"];
                        return $"{{ \"status\": {status}, \"fiscal_code\": \"{fiscalCode}\" }}";
                    }</set-body>
                    <set-header name="x-functions-key" exists-action="override">
                        <value>{{io-wallet-user-func-key}}</value>
                    </set-header>
                </inbound>
                <outbound>
                    <base />
                </outbound>
                <backend>
                    <base />
                </backend>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.apim_itn.azurerm_api_management_named_value.support_func_key will be created
  + resource "azurerm_api_management_named_value" "support_func_key" {
      + api_management_name = "io-p-itn-apim-01"
      + display_name        = "io-wallet-support-func-key"
      + id                  = (known after apply)
      + name                = "io-wallet-support-func-key"
      + resource_group_name = "io-p-itn-common-rg-01"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.apim_itn.azurerm_api_management_named_value.trial_id will be created
  + resource "azurerm_api_management_named_value" "trial_id" {
      + api_management_name = "io-p-itn-apim-01"
      + display_name        = "trial-id"
      + id                  = (known after apply)
      + name                = "trial-id"
      + resource_group_name = "io-p-itn-common-rg-01"
      + secret              = false
      + value               = (sensitive value)
    }

  # module.apim_itn.azurerm_api_management_named_value.trial_system_api_key will be created
  + resource "azurerm_api_management_named_value" "trial_system_api_key" {
      + api_management_name = "io-p-itn-apim-01"
      + display_name        = "trial-system-api-key"
      + id                  = (known after apply)
      + name                = "trial-system-api-key"
      + resource_group_name = "io-p-itn-common-rg-01"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.apim_itn.azurerm_api_management_named_value.user_func_key will be created
  + resource "azurerm_api_management_named_value" "user_func_key" {
      + api_management_name = "io-p-itn-apim-01"
      + display_name        = "io-wallet-user-func-key"
      + id                  = (known after apply)
      + name                = "io-wallet-user-func-key"
      + resource_group_name = "io-p-itn-common-rg-01"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.apim_itn.module.apim_v2_wallet_pdnd_api.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + api_type              = (known after apply)
      + description           = "API access limited by PDND token authentication"
      + display_name          = "IO Wallet - PDND"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-wallet-pdnd-api"
      + path                  = "api/v1/wallet/pdnd"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = "https://io-p-itn-wallet-user-func-02.azurewebsites.net/api/v1/wallet"
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = jsonencode(
                {
                  + components = {
                      + responses       = {
                          + BadRequest           = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Validation error"
                            }
                          + InternalServerError  = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Internal Server Error"
                            }
                          + NotFound             = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "The specified resource was not found"
                            }
                          + ServiceUnavailable   = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Service Unavailable"
                            }
                          + Unauthorized         = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Unauthorized"
                            }
                          + UnprocessableContent = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Unprocessable Content"
                            }
                        }
                      + schemas         = {
                          + FiscalCode                  = {
                              + description = "User's fiscal code."
                              + example     = "SPNDNL80R13C555X"
                              + format      = "FiscalCode"
                              + type        = "string"
                              + x-import    = "@pagopa/ts-commons/lib/strings"
                            }
                          + ProblemJson                 = {
                              + properties = {
                                  + detail   = {
                                      + description = <<-EOT
                                            A human readable explanation specific to this occurrence of the
                                            problem.
                                        EOT
                                      + example     = "There was an error processing the request"
                                      + type        = "string"
                                    }
                                  + instance = {
                                      + description = "An absolute URI that identifies the specific occurrence of the problem. It may or may not yield further information if dereferenced."
                                      + format      = "uri"
                                      + type        = "string"
                                    }
                                  + status   = {
                                      + description      = "The HTTP status code generated by the origin server for this occurrence of the problem."
                                      + example          = 500
                                      + exclusiveMaximum = true
                                      + format           = "int32"
                                      + maximum          = 600
                                      + minimum          = 100
                                      + type             = "integer"
                                    }
                                  + title    = {
                                      + description = "A short, summary of the problem type. Written in english and readable for engineers (usually not suited for non technical stakeholders and not localized); example: Service Unavailable"
                                      + type        = "string"
                                    }
                                  + type     = {
                                      + default     = "about:blank"
                                      + description = <<-EOT
                                            An absolute URI that identifies the problem type. When dereferenced,
                                            it SHOULD provide human-readable documentation for the problem type
                                            (e.g., using HTML).
                                        EOT
                                      + example     = "https://example.com/problem/constraint-violation"
                                      + format      = "uri"
                                      + type        = "string"
                                    }
                                }
                              + type       = "object"
                            }
                          + SetWalletInstanceStatusData = {
                              + properties = {
                                  + fiscal_code = {
                                      + "$ref" = "#/components/schemas/FiscalCode"
                                    }
                                  + status      = {
                                      + enum = [
                                          + "REVOKED",
                                        ]
                                      + type = "string"
                                    }
                                }
                              + required   = [
                                  + "status",
                                  + "fiscal_code",
                                ]
                              + type       = "object"
                            }
                        }
                      + securitySchemes = {
                          + BearerAuth = {
                              + bearerFormat = "JWT"
                              + scheme       = "bearer"
                              + type         = "http"
                            }
                        }
                    }
                  + info       = {
                      + title   = "IO Wallet API"
                      + version = "1.0.0"
                    }
                  + openapi    = "3.0.3"
                  + paths      = {
                      + "/status"                       = {
                          + get = {
                              + operationId = "healthCheck"
                              + responses   = {
                                  + "200" = {
                                      + content     = {
                                          + "application/problem+json" = {
                                              + schema = {
                                                  + properties = {
                                                      + detail   = {
                                                          + enum = [
                                                              + "The service is healthy",
                                                            ]
                                                          + type = "string"
                                                        }
                                                      + instance = {
                                                          + enum = [
                                                              + "/status",
                                                            ]
                                                          + type = "string"
                                                        }
                                                      + status   = {
                                                          + enum   = [
                                                              + 200,
                                                            ]
                                                          + format = "int32"
                                                          + type   = "integer"
                                                        }
                                                      + title    = {
                                                          + enum = [
                                                              + "OK",
                                                            ]
                                                          + type = "string"
                                                        }
                                                      + type     = {
                                                          + enum = [
                                                              + "about:blank",
                                                            ]
                                                          + type = "string"
                                                        }
                                                    }
                                                  + type       = "object"
                                                }
                                            }
                                        }
                                      + description = "The function is health"
                                    }
                                  + "500" = {
                                      + content     = {
                                          + "application/problem+json" = {
                                              + schema = {
                                                  + "$ref" = "#/components/schemas/ProblemJson"
                                                }
                                            }
                                        }
                                      + description = "Internal Server Error"
                                    }
                                }
                              + summary     = "Used to check if the function is healthy"
                            }
                        }
                      + "/wallet-instances/{id}/status" = {
                          + put = {
                              + description = <<-EOT
                                    Revoke the Wallet Instance. 
                                    If the Wallet Instance is already revoked, the operation succeed.
                                EOT
                              + operationId = "setWalletInstanceStatus"
                              + parameters  = [
                                  + {
                                      + in       = "path"
                                      + name     = "id"
                                      + required = true
                                      + schema   = {
                                          + type = "string"
                                        }
                                    },
                                ]
                              + requestBody = {
                                  + content = {
                                      + "application/json" = {
                                          + schema = {
                                              + "$ref" = "#/components/schemas/SetWalletInstanceStatusData"
                                            }
                                        }
                                    }
                                }
                              + responses   = {
                                  + "204" = {
                                      + description = "Wallet Instance status successfully set"
                                    }
                                  + "400" = {
                                      + "$ref" = "#/components/responses/BadRequest"
                                    }
                                  + "401" = {
                                      + "$ref" = "#/components/responses/Unauthorized"
                                    }
                                  + "422" = {
                                      + "$ref" = "#/components/responses/UnprocessableContent"
                                    }
                                  + "500" = {
                                      + "$ref" = "#/components/responses/InternalServerError"
                                    }
                                  + "503" = {
                                      + "$ref" = "#/components/responses/ServiceUnavailable"
                                    }
                                }
                              + summary     = "Revoke a Wallet Instance"
                            }
                        }
                    }
                  + security   = [
                      + {
                          + BearerAuth = []
                        },
                    ]
                }
            )
        }
    }

  # module.apim_itn.module.apim_v2_wallet_pdnd_api.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-wallet-pdnd-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <!-- validate the jwt using the specified OpenID configuration URLs -->
                    <validate-jwt header-name="Authorization" require-scheme="Bearer">
                        <openid-config url="https://wallet.io.pagopa.it/pdnd/openid-configuration" />
                    </validate-jwt>
                    <set-header name="Authorization" exists-action="delete" />
                </inbound>
                <outbound>
                    <base />
                </outbound>
                <backend>
                    <base />
                </backend>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.apim_itn.module.apim_v2_wallet_pdnd_api.azurerm_api_management_product_api.this["io-p-wallet-pdnd-api"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-wallet-pdnd-api"
      + id                  = (known after apply)
      + product_id          = "io-p-wallet-pdnd-api"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.apim_itn.module.apim_v2_wallet_pdnd_product.azurerm_api_management_product.this will be created
  + resource "azurerm_api_management_product" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + approval_required     = false
      + description           = "Product containing APIs that must be called using the PDND token for authentication"
      + display_name          = "IO WALLET PDND TOKEN-PROTECTED APIs"
      + id                    = (known after apply)
      + product_id            = "io-p-wallet-pdnd-api"
      + published             = true
      + resource_group_name   = "io-p-itn-common-rg-01"
      + subscription_required = false
    }

  # module.apim_itn.module.apim_v2_wallet_support_api.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + api_type              = (known after apply)
      + description           = "API for Wallet Support Assistance"
      + display_name          = "IO Wallet - Support"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-wallet-support-api"
      + path                  = "api/v1/wallet/support"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = "https://io-p-itn-wallet-supp-func-01.azurewebsites.net/api/v1/wallet"
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = jsonencode(
                {
                  + components = {
                      + responses       = {
                          + InternalServerError  = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Internal Server Error"
                            }
                          + NotFound             = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "The specified resource was not found"
                            }
                          + UnprocessableContent = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Unprocessable Content"
                            }
                        }
                      + schemas         = {
                          + AndroidDeviceDetails                     = {
                              + properties = {
                                  + os_patch_level = {
                                      + type = "number"
                                    }
                                  + os_version     = {
                                      + type = "number"
                                    }
                                  + platform       = {
                                      + enum = [
                                          + "android",
                                        ]
                                      + type = "string"
                                    }
                                }
                              + required   = [
                                  + "platform",
                                ]
                              + type       = "object"
                            }
                          + DeviceDetails                            = {
                              + description = "User device information"
                              + oneOf       = [
                                  + {
                                      + "$ref" = "#/components/schemas/AndroidDeviceDetails"
                                    },
                                  + {
                                      + "$ref" = "#/components/schemas/IosDeviceDetails"
                                    },
                                ]
                              + type        = "object"
                            }
                          + FiscalCode                               = {
                              + description = "User's fiscal code."
                              + example     = "SPNDNL80R13C555X"
                              + format      = "FiscalCode"
                              + type        = "string"
                              + x-import    = "@pagopa/ts-commons/lib/strings"
                            }
                          + GetCurrentWalletInstanceByFiscalCodeBody = {
                              + properties = {
                                  + fiscal_code = {
                                      + "$ref" = "#/components/schemas/FiscalCode"
                                    }
                                }
                              + required   = [
                                  + "fiscal_code",
                                ]
                              + type       = "object"
                            }
                          + IosDeviceDetails                         = {
                              + properties = {
                                  + platform = {
                                      + enum = [
                                          + "ios",
                                        ]
                                      + type = "string"
                                    }
                                }
                              + required   = [
                                  + "platform",
                                ]
                              + type       = "object"
                            }
                          + ProblemJson                              = {
                              + properties = {
                                  + detail   = {
                                      + description = <<-EOT
                                            A human readable explanation specific to this occurrence of the
                                            problem.
                                        EOT
                                      + example     = "There was an error processing the request"
                                      + type        = "string"
                                    }
                                  + instance = {
                                      + description = "An absolute URI that identifies the specific occurrence of the problem. It may or may not yield further information if dereferenced."
                                      + format      = "uri"
                                      + type        = "string"
                                    }
                                  + status   = {
                                      + description      = "The HTTP status code generated by the origin server for this occurrence of the problem."
                                      + example          = 200
                                      + exclusiveMaximum = true
                                      + format           = "int32"
                                      + maximum          = 600
                                      + minimum          = 100
                                      + type             = "integer"
                                    }
                                  + title    = {
                                      + description = "A short, summary of the problem type. Written in english and readable for engineers (usually not suited for non technical stakeholders and not localized); example: Service Unavailable"
                                      + type        = "string"
                                    }
                                  + type     = {
                                      + default     = "about:blank"
                                      + description = <<-EOT
                                            An absolute URI that identifies the problem type. When dereferenced,
                                            it SHOULD provide human-readable documentation for the problem type
                                            (e.g., using HTML).
                                        EOT
                                      + example     = "https://example.com/problem/constraint-violation"
                                      + format      = "uri"
                                      + type        = "string"
                                    }
                                }
                              + type       = "object"
                            }
                          + Timestamp                                = {
                              + description = "A date-time field in ISO-8601 format and UTC timezone."
                              + example     = "2018-10-13T00:00:00.000Z"
                              + format      = "UTCISODateFromString"
                              + type        = "string"
                              + x-import    = "@pagopa/ts-commons/lib/dates"
                            }
                          + WalletInstanceData                       = {
                              + description = "Current wallet instance information"
                              + properties  = {
                                  + created_at     = {
                                      + "$ref" = "#/components/schemas/Timestamp"
                                    }
                                  + device_details = {
                                      + "$ref" = "#/components/schemas/DeviceDetails"
                                    }
                                  + id             = {
                                      + type = "string"
                                    }
                                  + is_revoked     = {
                                      + type = "boolean"
                                    }
                                  + revoked_at     = {
                                      + "$ref" = "#/components/schemas/Timestamp"
                                    }
                                }
                              + required    = [
                                  + "id",
                                  + "is_revoked",
                                  + "created_at",
                                ]
                              + type        = "object"
                            }
                        }
                      + securitySchemes = {
                          + FunctionsKey = {
                              + in   = "header"
                              + name = "X-Functions-Key"
                              + type = "apiKey"
                            }
                        }
                    }
                  + info       = {
                      + title   = "IO Wallet - Support API"
                      + version = "1.0.0"
                    }
                  + openapi    = "3.0.3"
                  + paths      = {
                      + "/wallet-instances/current" = {
                          + post = {
                              + operationId = "getCurrentWalletInstanceByFiscalCode"
                              + requestBody = {
                                  + content  = {
                                      + "application/json" = {
                                          + schema = {
                                              + "$ref" = "#/components/schemas/GetCurrentWalletInstanceByFiscalCodeBody"
                                            }
                                        }
                                    }
                                  + required = true
                                }
                              + responses   = {
                                  + "200" = {
                                      + content     = {
                                          + "application/json" = {
                                              + schema = {
                                                  + "$ref" = "#/components/schemas/WalletInstanceData"
                                                }
                                            }
                                        }
                                      + description = "Wallet Instance successfully retrieved"
                                    }
                                  + "404" = {
                                      + "$ref" = "#/components/responses/NotFound"
                                    }
                                  + "422" = {
                                      + "$ref" = "#/components/responses/UnprocessableContent"
                                    }
                                  + "500" = {
                                      + "$ref" = "#/components/responses/InternalServerError"
                                    }
                                }
                              + security    = [
                                  + {
                                      + FunctionsKey = []
                                    },
                                ]
                              + summary     = "Retrieve the current Wallet Instance information given a fiscal code"
                            }
                        }
                    }
                  + servers    = [
                      + {
                          + url = "https://io-p-itn-wallet-support-func-01.azurewebsites.net/api/v1/wallet"
                        },
                    ]
                }
            )
        }
    }

  # module.apim_itn.module.apim_v2_wallet_support_api.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-wallet-support-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
              <inbound>
                  <base />
                  <set-header name="x-functions-key" exists-action="override">
                      <value>{{io-wallet-support-func-key}}</value>
                  </set-header>
              </inbound>
              <outbound>
                  <base />
              </outbound>
            </policies>
        EOT
    }

  # module.apim_itn.module.apim_v2_wallet_support_api.azurerm_api_management_product_api.this["io-p-wallet-support-api"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-wallet-support-api"
      + id                  = (known after apply)
      + product_id          = "io-p-wallet-support-api"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.apim_itn.module.apim_v2_wallet_support_product.azurerm_api_management_product.this will be created
  + resource "azurerm_api_management_product" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + approval_required     = false
      + description           = "Product containing APIs for Wallet Support Assistance"
      + display_name          = "IO WALLET SUPPORT API"
      + id                    = (known after apply)
      + product_id            = "io-p-wallet-support-api"
      + published             = true
      + resource_group_name   = "io-p-itn-common-rg-01"
      + subscription_required = true
    }

  # module.apim_itn.module.apim_v2_web_wallet_api.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + api_type              = (known after apply)
      + description           = "Wallet APIs"
      + display_name          = "IO Web - Wallet"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-ioweb-wallet"
      + path                  = "ioweb/wallet/api/v1"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = "https://io-p-itn-wallet-user-func-02.azurewebsites.net/api/v1/wallet"
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = jsonencode(
                {
                  + components = {
                      + responses       = {
                          + BadRequest           = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Validation error"
                            }
                          + Forbidden            = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "The server understands the request but refuses to authorize it"
                            }
                          + InternalServerError  = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Internal Server Error"
                            }
                          + NotFound             = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "The specified resource was not found"
                            }
                          + Unauthorized         = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Unauthorized"
                            }
                          + UnprocessableContent = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Unprocessable Content"
                            }
                        }
                      + schemas         = {
                          + ProblemJson                 = {
                              + properties = {
                                  + detail   = {
                                      + description = <<-EOT
                                            A human readable explanation specific to this occurrence of the
                                            problem.
                                        EOT
                                      + example     = "There was an error processing the request"
                                      + type        = "string"
                                    }
                                  + instance = {
                                      + description = "An absolute URI that identifies the specific occurrence of the problem. It may or may not yield further information if dereferenced."
                                      + format      = "uri"
                                      + type        = "string"
                                    }
                                  + status   = {
                                      + description      = "The HTTP status code generated by the origin server for this occurrence of the problem."
                                      + example          = 500
                                      + exclusiveMaximum = true
                                      + format           = "int32"
                                      + maximum          = 600
                                      + minimum          = 100
                                      + type             = "integer"
                                    }
                                  + title    = {
                                      + description = "A short, summary of the problem type. Written in english and readable for engineers (usually not suited for non technical stakeholders and not localized); example: Service Unavailable"
                                      + type        = "string"
                                    }
                                  + type     = {
                                      + default     = "about:blank"
                                      + description = <<-EOT
                                            An absolute URI that identifies the problem type. When dereferenced,
                                            it SHOULD provide human-readable documentation for the problem type
                                            (e.g., using HTML).
                                        EOT
                                      + example     = "https://example.com/problem/constraint-violation"
                                      + format      = "uri"
                                      + type        = "string"
                                    }
                                }
                              + type       = "object"
                            }
                          + SetWalletInstanceStatusData = {
                              + enum = [
                                  + "REVOKED",
                                ]
                              + type = "string"
                            }
                          + WalletData                  = {
                              + description = "Describes the status of the wallet."
                              + properties  = {
                                  + id         = {
                                      + type = "string"
                                    }
                                  + is_revoked = {
                                      + type = "boolean"
                                    }
                                }
                              + required    = [
                                  + "id",
                                  + "is_revoked",
                                ]
                              + type        = "object"
                            }
                        }
                      + securitySchemes = {
                          + BearerAuth = {
                              + bearerFormat = "JWT"
                              + scheme       = "bearer"
                              + type         = "http"
                            }
                        }
                    }
                  + info       = {
                      + title   = "IO Wallet - IO Web API"
                      + version = "1.0.0"
                    }
                  + openapi    = "3.0.3"
                  + paths      = {
                      + "/wallet-instances/current/status" = {
                          + get = {
                              + operationId = "getCurrentWalletInstanceStatus"
                              + responses   = {
                                  + "200" = {
                                      + content     = {
                                          + "application/json" = {
                                              + schema = {
                                                  + "$ref" = "#/components/schemas/WalletData"
                                                }
                                            }
                                        }
                                      + description = "Wallet Instance status successfully retrieved"
                                    }
                                  + "401" = {
                                      + "$ref" = "#/components/responses/Unauthorized"
                                    }
                                  + "403" = {
                                      + "$ref" = "#/components/responses/Forbidden"
                                    }
                                  + "404" = {
                                      + "$ref" = "#/components/responses/NotFound"
                                    }
                                  + "500" = {
                                      + "$ref" = "#/components/responses/InternalServerError"
                                    }
                                }
                              + summary     = "Retrieve the current Wallet Instance status"
                            }
                        }
                      + "/wallet-instances/{id}/status"    = {
                          + put = {
                              + description = <<-EOT
                                    Revoke the Wallet Instance associated with the authenticated user. 
                                    If the Wallet Instance is already revoked, the operation succeed.
                                EOT
                              + operationId = "setWalletInstanceStatus"
                              + parameters  = [
                                  + {
                                      + in       = "path"
                                      + name     = "id"
                                      + required = true
                                      + schema   = {
                                          + type = "string"
                                        }
                                    },
                                ]
                              + requestBody = {
                                  + content = {
                                      + "application/json" = {
                                          + schema = {
                                              + "$ref" = "#/components/schemas/SetWalletInstanceStatusData"
                                            }
                                        }
                                    }
                                }
                              + responses   = {
                                  + "204" = {
                                      + description = "Wallet Instance status successfully set"
                                    }
                                  + "400" = {
                                      + "$ref" = "#/components/responses/BadRequest"
                                    }
                                  + "401" = {
                                      + "$ref" = "#/components/responses/Unauthorized"
                                    }
                                  + "403" = {
                                      + "$ref" = "#/components/responses/Forbidden"
                                    }
                                  + "422" = {
                                      + "$ref" = "#/components/responses/UnprocessableContent"
                                    }
                                  + "500" = {
                                      + "$ref" = "#/components/responses/InternalServerError"
                                    }
                                }
                              + summary     = "Revoke a Wallet Instance"
                            }
                        }
                    }
                  + security   = [
                      + {
                          + BearerAuth = []
                        },
                    ]
                }
            )
        }
    }

  # module.apim_itn.module.apim_v2_web_wallet_api.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-ioweb-wallet"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <!-- TODO SIW-1820 -->
            <policies>
                <inbound>
                    <base />
                    <cors>
                        <allowed-origins>
                            <origin>https://ioapp.it/</origin>
                        </allowed-origins>
                        <allowed-methods preflight-result-max-age="300">
                            <method>OPTIONS</method>
                            <method>GET</method>
                            <method>PUT</method>
                        </allowed-methods>
                        <allowed-headers>
                            <header>Content-Type</header>
                            <header>Authorization</header>
                        </allowed-headers>
                    </cors>
                    <!-- validate the jwt using the specified OpenID configuration URLs. Both URLs are used to ensure token validation across different identity providers -->
                    <validate-jwt header-name="Authorization" require-scheme="Bearer" output-token-variable-name="jwt">
                        <openid-config url="https://wallet.io.pagopa.it/hub-spid-login/openid-configuration" />
                        <openid-config url="https://wallet.io.pagopa.it/exchange/openid-configuration" />
                        <required-claims>
                            <claim name="fiscal_number" />
                        </required-claims>
                    </validate-jwt>
                    <!-- get the claim fiscal_number -->
                    <set-variable name="fiscalCode" value="@((string)((Jwt)context.Variables["jwt"]).Claims.GetValueOrDefault("fiscal_number"))" />
                    <!-- send the request to trial system -->
                    <send-request mode="new" response-variable-name="trialSystemResponse" timeout="5">
                        <set-url>@($"https://api.trial.pagopa.it/manage/api/v1/trials/{{trial-id}}/subscriptions/{context.Variables["fiscalCode"]}")</set-url>
                        <set-method>GET</set-method>
                        <set-header name="Ocp-Apim-Subscription-Key" exists-action="override">
                            <value>{{trial-system-api-key}}</value>
                        </set-header>
                    </send-request>
                    <set-variable name="isActive" value="@{
                        var state = (string)((IResponse)context.Variables["trialSystemResponse"]).Body.As<JObject>()["state"];
                        return state == "ACTIVE";
                    } " />
                    <choose>
                        <when condition="@(context.Variables.GetValueOrDefault<bool>("isActive") != true)">
                            <return-response>
                                <set-status code="403" reason="Forbidden" />
                                <set-body template="liquid">{ "detail": "Access to this resource is forbidden", "status": 403, "title": "Forbidden" } </set-body>
                            </return-response>
                        </when>
                        <otherwise />
                    </choose>
                </inbound>
                <outbound>
                    <base />
                </outbound>
            </policies>
        EOT
    }

  # module.apim_itn.module.apim_v2_web_wallet_api.azurerm_api_management_product_api.this["io-web-api"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-ioweb-wallet"
      + id                  = (known after apply)
      + product_id          = "io-web-api"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.cosmos.module.wallet_cosmosdb_containers["nonces"].azurerm_cosmosdb_sql_container.this will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlDatabases/db/containers/nonces"
        name                = "nonces"
        # (6 unchanged attributes hidden)

      ~ autoscale_settings {
          ~ max_throughput = 10000 -> 15000
        }

        # (2 unchanged blocks hidden)
    }

  # module.cosmos.module.wallet_cosmosdb_containers["wallet-instances"].azurerm_cosmosdb_sql_container.this will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlDatabases/db/containers/wallet-instances"
        name                = "wallet-instances"
        # (5 unchanged attributes hidden)

      ~ autoscale_settings {
          ~ max_throughput = 15000 -> 20000
        }

        # (2 unchanged blocks hidden)
    }

Plan: 19 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
